In [1]:
import pandas as p

In [2]:
singers={
    "Name":["Ar rahman","Anirudh","Santhosh narayanan","sakthi sree gopalan","shreya goshal","Andrea"],
    "Gender":["Male","Male","Male","Female","Female","Female"],
    "songs":["ponninadhi","hukkum","The one","theyn sudareyy","munbe vaa","ooh solriya"],
    "count":[150,75,80,45,70,25]
}
print(singers)

{'Name': ['Ar rahman', 'Anirudh', 'Santhosh narayanan', 'sakthi sree gopalan', 'shreya goshal', 'Andrea'], 'Gender': ['Male', 'Male', 'Male', 'Female', 'Female', 'Female'], 'songs': ['ponninadhi', 'hukkum', 'The one', 'theyn sudareyy', 'munbe vaa', 'ooh solriya'], 'count': [150, 75, 80, 45, 70, 25]}

In [3]:
#DATA FRAME


singers={
    "Name":["Ar rahman","Anirudh","Santhosh narayanan","sakthi sree gopalan","shreya goshal","Andrea"],
    "Gender":["Male","Male","Male","Female","Female","Female"],
    "songs":["ponninadhi","hukkum","The one","theyn sudareyy","munbe vaa","ooh solriya"],
    "count":[150,75,80,45,70,25]
}
df=p.DataFrame(singers)
df

                  Name  Gender           songs  count
0            Ar rahman    Male      ponninadhi    150
1              Anirudh    Male          hukkum     75
2   Santhosh narayanan    Male         The one     80
3  sakthi sree gopalan  Female  theyn sudareyy     45
4        shreya goshal  Female       munbe vaa     70
5               Andrea  Female     ooh solriya     25

In [4]:
#DISPLAY TOP 
df.head()

                  Name  Gender           songs  count
0            Ar rahman    Male      ponninadhi    150
1              Anirudh    Male          hukkum     75
2   Santhosh narayanan    Male         The one     80
3  sakthi sree gopalan  Female  theyn sudareyy     45
4        shreya goshal  Female       munbe vaa     70

In [5]:
df.head(3)

                 Name Gender       songs  count
0           Ar rahman   Male  ponninadhi    150
1             Anirudh   Male      hukkum     75
2  Santhosh narayanan   Male     The one     80

In [6]:
#DISPLAY BOTTOM

df.tail()

                  Name  Gender           songs  count
1              Anirudh    Male          hukkum     75
2   Santhosh narayanan    Male         The one     80
3  sakthi sree gopalan  Female  theyn sudareyy     45
4        shreya goshal  Female       munbe vaa     70
5               Andrea  Female     ooh solriya     25

In [7]:
df.tail(2)

            Name  Gender        songs  count
4  shreya goshal  Female    munbe vaa     70
5         Andrea  Female  ooh solriya     25

In [8]:
df.shape

(6, 4)

In [9]:
df.isnull()

    Name  Gender  songs  count
0  False   False  False  False
1  False   False  False  False
2  False   False  False  False
3  False   False  False  False
4  False   False  False  False
5  False   False  False  False

In [10]:
df.isnull().sum()

Name      0
Gender    0
songs     0
count     0
dtype: int64

In [12]:
df.isnull

<bound method DataFrame.isnull of                   Name  Gender           songs  count
0            Ar rahman    Male      ponninadhi    150
1              Anirudh    Male          hukkum     75
2   Santhosh narayanan    Male         The one     80
3  sakthi sree gopalan  Female  theyn sudareyy     45
4        shreya goshal  Female       munbe vaa     70
5               Andrea  Female     ooh solriya     25>

In [15]:
df.discribe(include='all')

AttributeError: 'DataFrame' object has no attribute 'discribe'

In [16]:
#FIND UNIQUE
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [17]:
#FIND UNIQUE COUNT
df['Gender'].nunique()

2

In [1]:
df['Name'].value.counts()

NameError: name 'df' is not defined